[Build_sanctuary.A_Sanctuary_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在此城镇建造新建筑的选项。\n每天提供500 %ICON_GOLD 黄金。"

[Build_sanctuary.A_Sanctuary_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供500 %ICON_GOLD 黄金。"

[Build_sanctuary.A_Sanctuary_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供1000 %ICON_GOLD 黄金。"

[Build_sanctuary.A_sanctuary_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供2500 %ICON_GOLD 黄金。你只能拥有一个国会。"

[Build_sanctuary.A_Sanctuary_Fortifications_Level1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门，并生产守军单位直至达到驻军上限"

[Build_sanctuary.A_Sanctuary_Fortifications_Level2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加产量"

[Build_sanctuary.A_Sanctuary_Fortifications_Level3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低产量"

[Build_sanctuary.A_Sanctuary_tower_defence H7TownTower]
mName="珊瑚城垛"
mDesc="在攻城战中为城镇提供2座防御塔。\n为防守方军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[Build_sanctuary.A_Sanctuary_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供7个随机的1级法术。\n它们会授予所有满足条件的来访英雄。"

[Build_sanctuary.A_Sanctuary_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供6个随机的2级法术。\n它们会授予所有满足条件的来访英雄。"

[Build_sanctuary.A_Sanctuary_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供4个随机的3级法术。\n它们会授予所有满足条件的来访英雄。"

[Build_sanctuary.A_Sanctuary_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供2个随机的4级法术。\n它们会授予所有满足条件的来访英雄。"

[Build_sanctuary.A_Sanctuary_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="允许招募英雄，包括新英雄和战败的英雄。新英雄的选择在每周初更换。"

[Build_sanctuary.A_Sanctuary_t2_basel H7TownDwelling]
mName="湖泊"
mDesc="核心生物住所。\n允许招募鲨鱼战士，每周产量为18。"

[Build_sanctuary.A_Sanctuary_t2_upragate H7TownDwelling]
mName="凶险湖泊"
mDesc="核心生物住所升级。\n允许招募并将鲨鱼战士升级为鳄鲛。\n(基础产量：18/周)"

[Build_sanctuary.A_Sanctuary_t2_growth_bonus H7TownGrowthEnhancer]
mName="蓝色海洋"
mDesc="核心生物住所升级。\n每周+9个鲨鱼战士或鳄鲛。"

[Build_sanctuary.A_Sanctuary_buil_t1_base H7TownDwelling]
mName="沼泽"
mDesc="核心生物住所。\n允许招募河童，每周产量为20。"

[Build_sanctuary.A_Sanctuary_t1_upragatel H7TownDwelling]
mName="腐蚀沼泽"
mDesc="核心生物住所升级。\n允许招募并将河童升级为河童庄屋。\n(基础产量：20/周)"

[Build_sanctuary.A_Sanctuary_t1_bonus_growth H7TownGrowthEnhancer]
mName="泥潭"
mDesc="核心生物住所升级。\n每周+10个河童或河童庄屋。"

[Build_sanctuary.A_Sanctuary_base_t3 H7TownDwelling]
mName="失落岛屿"
mDesc="核心生物住所。\n允许招募养鲸娜迦，每周产量为8。"

[Build_sanctuary.A_Sanctuary_upragate_t3 H7TownDwelling]
mName="赛菲罗斯岛"
mDesc="核心生物住所升级。\n允许招募并将养鲸娜迦升级为猎鲸娜迦。\n(基础产量：8/周)"

[Build_sanctuary.A_Sanctuary_t3_grothw_bonus H7TownGrowthEnhancer]
mName="万神殿"
mDesc="核心生物住所升级。\n每周+6个养鲸娜迦或猎鲸娜迦。"

[Build_sanctuary.A_Sanctuary_t4_base H7TownDwelling]
mName="礁石"
mDesc="精英生物住所。\n允许招募水之少女，每周产量为6。"

[Build_sanctuary.A_Sanctuary_t4_upragate H7TownDwelling]
mName="广阔海洋"
mDesc="精英生物住所升级。\n允许招募并将水之少女升级为水女。\n(基础产量：6/周)"

[Build_sanctuary.A_Sanctuary_t4_grothw_bonus H7TownGrowthEnhancer]
mName="岩峰"
mDesc="精英生物住所升级。\n每周+5个水之少女或水女。"

[Build_sanctuary.A_sanctuary_t5_base H7TownDwelling]
mName="海洋守护者"
mDesc="精英生物住所。\n允许招募海洋守护者，每周产量为5。"

[Build_sanctuary.A_Sanctuary_t5_upragate H7TownDwelling]
mName="深渊万神殿"
mDesc="精英生物住所升级。\n允许招募并将海洋守护者升级为深渊守护者。\n(基础产量：5/周)"

[Build_sanctuary.A_Sanctuary_t5_bonus_grothw H7TownGrowthEnhancer]
mName="武器库"
mDesc="精英生物住所升级。\n每周+5个海洋守护者/深渊守护者\n或养正馆神猴/神猴王。"

[Build_sanctuary.A_sanctuary_t6_base H7TownDwelling]
mName="娜迦巢穴"
mDesc="精英生物住所。\n允许招募浪人，每周产量为2。"

[Build_sanctuary.A_Sanctuary_t6_upragate H7TownDwelling]
mName="大名帝国"
mDesc="精英生物住所升级。\n允许招募并将浪人升级为大名。\n(基础产量：2/周)"

[Build_sanctuary.A_fSanctuary__t6_bonus_production H7TownGrowthEnhancer]
mName="荣耀圣坛"
mDesc="精英生物住所升级。\n每周+2个浪人或大名。"

[Build_sanctuary.A_Sanctuary_t7-2 H7TownDwelling]
mName="魔法池塘"
mDesc="冠军生物住所。\n允许招募麒麟，每周产量为2。"

[Build_sanctuary.A_Sanctuary_t7-2_upragate H7TownDwelling]
mName="神圣池塘"
mDesc="冠军生物住所升级。\n允许招募并将麒麟升级为神圣麒麟。\n(基础产量：2/周)"

[Build_sanctuary.A_Sanctuary_t7-1_base H7TownDwelling]
mName="深海"
mDesc="冠军生物住所。\n允许招募鳗女，每周产量为2。"

[Build_sanctuary.A_Sanctuary_t7_1_upragate H7TownDwelling]
mName="深渊海洋"
mDesc="冠军生物住所升级。\n允许招募并将鳗女升级为电气鳗女。\n(基础产量：2/周)"

[Build_sanctuary.A_Sanctuary_chambre_des_phoenix_du_gel H7TownDwelling]
mName="沉没国度"
mDesc="冠军生物住所。\n允许招募海神。\n可以使用"全部招募"功能进行招募。\n(基础产量：1/周)"

[Build_sanctuary.A_Sanctuary_chambre_des_beast H7TownDwelling]
mName="竹林"
mDesc="精英生物住所。\n允许招募神社武士。\n可以使用"全部招募"功能进行招募。\n(基础产量：4/周)"

[Build_sanctuary.A_Sanctuary_machine_war H7TownUtilityUnitDwelling]
mName="海葵田"
mDesc="战争单位生产。\n提供购买海葵战争单位的选项"

[Build_sanctuary.A_Sanctuary_Ecurie H7TownHallOfIntrigue]
mName="马厩"
mDesc="来访英雄在本周结束前获得+5移动力。"

[Build_sanctuary.A_Sanctuary_Ice_Bridge H7TownBuilding]
mName="命运协同"
mDesc="战斗开始时，友方生物获得+10 %icon_luck 幸运。"

[Build_sanctuary.A_Sanctuary_Marketplace H7TownMarketplace]
mName="市场"
mDesc="提供交易资源的选项。"

[Build_sanctuary.A_Sanctuary_Mine_prod H7TownBuilding]
mName="龙冰矿"
mDesc="每天提供2 %icon_wood 木材。"

[Build_sanctuary.A_Sanctuary_Moat H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。"

[Build_sanctuary.A_Sanctuary_ShadowsteelRefinery H7TownBuilding]
mName="水晶精炼厂"
mDesc="每天提供1 %icon_Crystal 龙血水晶。"

[Build_sanctuary.A_Sanctuary_SoulvenomCrucible H7TownBuilding]
mName="命运之泉"
mDesc="来访英雄在本周结束前从宝箱中获得的黄金增加50%。"

[Build_sanctuary.A_Sanctuary_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供付费获取对手信息的选项。"

[Build_sanctuary.A_Sanctuary_fonderie H7TownHallOfIntrigue]
mName="珍珠田"
mDesc="每天额外提供500 %ICON_GOLD 黄金。"

[Build_sanctuary.A_Sanctuary_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有访问此城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄能够返回此城镇，如果这是最近的可用城镇。"

[Build_sanctuary.A_Sanctuary_MarkOfMalassa H7TownTearOfAsha]
mName="莎拉萨印记"
mDesc="每天提供5000 %ICON_GOLD 黄金，并将此城镇的生物产量增加50%。\n间谍可以破坏和掠夺两个额外目标。"

[Ability_building.A_bulle_destin_Buffcreature H7BaseBuff]
mName="命运协同"
mTooltip="生物获得 %stat %icon_luck 幸运"

[Ability_building.A_gold_gain_Ability_Week1 H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="收税官"
mTooltip="第一周提供500 %special.icon 黄金，从第二周开始每周提供1000 %special.icon 黄金，每周可收集一次。"

[Ability_building.A_bulle_lucky_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="命运协同"
mTooltip="友方生物在战斗开始时获得+10幸运。"

[Ability_building.A_bulle_destin_BuffHero H7BaseBuff]
mName="命运协同"
mTooltip="战斗开始时，友方生物获得+10 %icon_luck 幸运。"

[Ability_building.A_gold_buff H7BaseBuff]
mName="命运之泉"
mTooltip="英雄在本周结束前从宝库中额外获得 %stat1 %stat1.icon 黄金。"

[Faction.H7Faction_Sanctuary H7Faction]
mFactionName="瀛洲"
mFactionFortName="瀛洲塔楼"
mFactionArmyName="瀛洲军队 %number"

[Sanctuary_Town.A_Sanctuary_TownLv1 H7Town]
mName=""

[Faction.A_Lore_FactionSanctuary H7GeneralLoreEntry]
mName="瀛洲"
mText="羽岛是一个封建国家，根据遍布泉眼或水体的寺庙组织起来。战士与僧侣，农民与诗人，他们都崇拜水龙神莎拉萨，她赐予他们基于此元素的魔法力量。娜迦旨在完善和净化自我；无论其名号或职业为何，他们都努力达到其主上和先辈传奇所设定的最高理想。\n羽岛由永世女皇统治，她已掌权数百年。与所有娜迦大师和教师一样，她要接受那些自认够格者的仪式性挑战。然而，无论是在武器、诗歌、书法还是哲学上，她从未在比试中落败。"

V1.37

Corrected Tower descrpition to explain defender stat gains
Made many corrections and tweaks to make descriptions across castles be more consistent and correct